In [2]:
import pandas as pd
import numpy as np

In [33]:
# 5.1 값 변경
# 1) 기본 변경
# 데이터프레임 만들기
dict = {'Name': ['Joo', 'Jang', 'Shin', 'Yeon'],
       'Level': ['Gold', 'Bronze', 'Silver', 'Gold'],
       'Points': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1', '2', '3', '4'])
df

   Name   Level  Points
1   Joo    Gold   56000
2  Jang  Bronze   23000
3  Shin  Silver   44000
4  Yeon    Gold   52000

In [12]:
# Points 열에 10 곱하기
df['Points'] = df['Points']*10
df

     Name   Level  Points
1st   Joo    Gold  560000
2nd  Jang  Bronze  230000
3rd  Shin  Silver  440000
4th  Yeon    Gold  520000

In [28]:
# Name 열 변경
df['Name'] = df['Name'] + ' player'
df

          Name   Level  Points
1   Joo player    Gold   56000
2  Jang player  Bronze   23000
3  Shin player  Silver   44000
4  Yeon player    Gold   52000

In [34]:
# 두번째 행, 첫 번째 열의 이름 바꾸기
df.loc['2', 'Name'] = 'Park'
df

   Name   Level  Points
1   Joo    Gold   56000
2  Park  Bronze   23000
3  Shin  Silver   44000
4  Yeon    Gold   52000